# GetCurrent Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MacroManagerIterator..::..GetCurrent Method
MacroManagerIterator Class See Also
---
Returns the current Macro module.
**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public MacroModule GetCurrent()
```

Visual Basic
---
```text
Public Function GetCurrent As MacroModule
```

Visual C++
---
```text
public:
MacroModule^ GetCurrent()
```

# ### Return Value
The current Macro module.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | There is no current item in the iterator. |

# See Also
MacroManagerIterator Class
Autodesk.Revit.DB.Macros Namespace